---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.WillRuleCheckElements(System.Int32)
source: html/c0e0c3cc-6293-e4f1-0eff-74a7624c100b.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.WillRuleCheckElements Method

Reports if rule needs to be executed on individual elements.

## Syntax (C#)
```csharp
public bool WillRuleCheckElements(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The rule index to get information for.

## Returns
True if rule needs to be executed on individual elements.